Revit 2025 API
DirectShapeTargetViewType Enumeration
 View types for which DirectShape objects are allowed to have alternative shape representations
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum DirectShapeTargetViewType
Public Enumeration DirectShapeTargetViewType
public enum class DirectShapeTargetViewType
type DirectShapeTargetViewType
Members
Member name | Value | Description
Undefined | 0 |  Invalid value
Default | 1 |  Shape to be used in all views for which a view-specific shape was not provided
Plan | 2 |  The alternate representation will be used only in Revit Plan views
See Also
Reference
Autodesk.Revit.DB Namespace